cmsis-svd/cmsis-svd/data/Atmel/ATSAME53N19A.svd
               <register>
                  <name>INTENSET</name>
                  <description>DEVICE Device Interrupt Enable Set</description>
                  <addressOffset>0x18</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>SUSPEND</name>
                        <description>Suspend Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MSOF</name>
                        <description>Micro Start of Frame Interrupt Enable in High Speed Mode</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SOF</name>
                        <description>Start Of Frame Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EORST</name>
                        <description>End of Reset Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WAKEUP</name>
                        <description>Wake Up Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EORSM</name>
                        <description>End Of Resume Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>UPRSM</name>
                        <description>Upstream Resume Interrupt Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RAMACER</name>
                        <description>Ram Access Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNYET</name>
                        <description>Link Power Management Not Yet Interrupt Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMSUSP</name>
                        <description>Link Power Management Suspend Interrupt Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>DEVICE Device Interrupt Flag</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>SUSPEND</name>
                        <description>Suspend</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MSOF</name>
                        <description>Micro Start of Frame in High Speed Mode</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SOF</name>
                        <description>Start Of Frame</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EORST</name>
                        <description>End of Reset</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WAKEUP</name>
                        <description>Wake Up</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EORSM</name>
                        <description>End Of Resume</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>UPRSM</name>
                        <description>Upstream Resume</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RAMACER</name>
                        <description>Ram Access</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNYET</name>
                        <description>Link Power Management Not Yet</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMSUSP</name>
                        <description>Link Power Management Suspend</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>EPINTSMRY</name>
                  <description>DEVICE End Point Interrupt Summary</description>
                  <addressOffset>0x20</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>EPINT0</name>
                        <description>End Point 0 Interrupt</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPINT1</name>
                        <description>End Point 1 Interrupt</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPINT2</name>
                        <description>End Point 2 Interrupt</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPINT3</name>
                        <description>End Point 3 Interrupt</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPINT4</name>
                        <description>End Point 4 Interrupt</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPINT5</name>
                        <description>End Point 5 Interrupt</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPINT6</name>
                        <description>End Point 6 Interrupt</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EPINT7</name>
                        <description>End Point 7 Interrupt</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DESCADD</name>
                  <description>Descriptor Address</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DESCADD</name>
                        <description>Descriptor Address Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PADCAL</name>
                  <description>USB PAD Calibration</description>
                  <addressOffset>0x28</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>TRANSP</name>
                        <description>USB Pad Transp calibration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>TRANSN</name>
                        <description>USB Pad Transn calibration</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>TRIM</name>
                        <description>USB Pad Trim calibration</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <cluster>
                  <dim>8</dim>
                  <dimIncrement>0x20</dimIncrement>
                  <name>DEVICE_ENDPOINT[%s]</name>
                  <description/>
                  <addressOffset>0x100</addressOffset>
                  <register>
                     <name>EPCFG</name>
                     <description>DEVICE_ENDPOINT End Point Configuration</description>
                     <addressOffset>0x0</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>EPTYPE0</name>
                           <description>End Point Type0</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>3</bitWidth>
                        </field>
                        <field>
                           <name>EPTYPE1</name>
                           <description>End Point Type1</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>3</bitWidth>
                        </field>
                        <field>
                           <name>NYETDIS</name>
                           <description>NYET Token Disable</description>
                           <bitOffset>7</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>EPSTATUSCLR</name>
                     <description>DEVICE_ENDPOINT End Point Pipe Status Clear</description>
                     <addressOffset>0x4</addressOffset>
                     <size>8</size>
                     <access>write-only</access>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>DTGLOUT</name>
                           <description>Data Toggle OUT Clear</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>DTGLIN</name>
                           <description>Data Toggle IN Clear</description>
                           <bitOffset>1</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>CURBK</name>
                           <description>Current Bank Clear</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALLRQ0</name>
                           <description>Stall 0 Request Clear</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALLRQ1</name>
                           <description>Stall 1 Request Clear</description>
                           <bitOffset>5</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>BK0RDY</name>
                           <description>Bank 0 Ready Clear</description>
                           <bitOffset>6</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>BK1RDY</name>
                           <description>Bank 1 Ready Clear</description>
                           <bitOffset>7</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>EPSTATUSSET</name>
                     <description>DEVICE_ENDPOINT End Point Pipe Status Set</description>
                     <addressOffset>0x5</addressOffset>
                     <size>8</size>
                     <access>write-only</access>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>DTGLOUT</name>
                           <description>Data Toggle OUT Set</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>DTGLIN</name>
                           <description>Data Toggle IN Set</description>
                           <bitOffset>1</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>CURBK</name>
                           <description>Current Bank Set</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALLRQ0</name>
                           <description>Stall 0 Request Set</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALLRQ1</name>
                           <description>Stall 1 Request Set</description>
                           <bitOffset>5</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>BK0RDY</name>
                           <description>Bank 0 Ready Set</description>
                           <bitOffset>6</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>BK1RDY</name>
                           <description>Bank 1 Ready Set</description>
                           <bitOffset>7</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>EPSTATUS</name>
                     <description>DEVICE_ENDPOINT End Point Pipe Status</description>
                     <addressOffset>0x6</addressOffset>
                     <size>8</size>
                     <access>read-only</access>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>DTGLOUT</name>
                           <description>Data Toggle Out</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>DTGLIN</name>
                           <description>Data Toggle In</description>
                           <bitOffset>1</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>CURBK</name>
                           <description>Current Bank</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALLRQ0</name>
                           <description>Stall 0 Request</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALLRQ1</name>
                           <description>Stall 1 Request</description>
                           <bitOffset>5</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>BK0RDY</name>
                           <description>Bank 0 ready</description>
                           <bitOffset>6</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>BK1RDY</name>
                           <description>Bank 1 ready</description>
                           <bitOffset>7</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>EPINTFLAG</name>
                     <description>DEVICE_ENDPOINT End Point Interrupt Flag</description>
                     <addressOffset>0x7</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>TRCPT0</name>
                           <description>Transfer Complete 0</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRCPT1</name>
                           <description>Transfer Complete 1</description>
                           <bitOffset>1</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRFAIL0</name>
                           <description>Error Flow 0</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRFAIL1</name>
                           <description>Error Flow 1</description>
                           <bitOffset>3</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>RXSTP</name>
                           <description>Received Setup</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALL0</name>
                           <description>Stall 0 In/out</description>
                           <bitOffset>5</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALL1</name>
                           <description>Stall 1 In/out</description>
                           <bitOffset>6</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
